# -*- coding:UTF-8 -*-

#  运算符使用
# +       -       *       **      /       //      %
# <<      >>      &       |       ^       ~       :=
# <       >       <=      >=      ==      !=      @

# 算术运算符
# + 加
print("5+2=", 5+2)
# - 减
print("5-2=", 5-2)
# * 乘
print("5*2=", 5*2)
# ** 乘方
print("5**2=", 5**2)
# / 除
print("5/2=", 5/2)
# // 整除
print("5//2=", 5//2)
# % 取余
print("5%2=", 5%2)

# 位运算符
# << 位左移
print("0b0001<<2=", bin(0b0001 << 2))
# >> 位右移
print("0b0100>>2=", bin(0b0100 >> 2))
# & 位与
print("0b1100&0b1001=", bin(0b1100&0b1001))
# | 位或
print("0b1100|0b1001=", bin(0b1100|0b1001))
# ^ 位异或
print("0b1100^0b1001=", bin(0b1100^0b1001))
# ~ 位取反
print("~0b0101=", bin(~0b0101))

# 比较运算符（正确打印True，错误打印Dalse）
# > 大于
print("1>2", 1>2)
# < 小于
print("1<2", 1<2)
# <= 小于等于
print("1<=2", 1<=2)
# >= 大于等于
print("1>=2", 1>=2)
# == 等于
print("1==2", 1==2)
# != 不等于
print("1!=2", 1!=2)

# 其他运算符
# := 与 @ 的作用需要到后面才能体现，这里暂时并不介绍